In [1]:
import pandas as pd
import numpy as np

In [25]:
a = np.arange(4)
a

array([0, 1, 2, 3])

In [26]:
b = pd.Series(a , index = ['q','s','e','f'])

In [8]:
a = a.reshape(1,9)

In [23]:
b[b >=0 ] = 4

In [27]:
b

q    0
s    1
e    2
f    3
dtype: int32

In [29]:
serd = pd.Series([1,0,2,1,2,3], index=['white','white','blue','green','green','yellow'])

In [38]:
s2 = pd.Series([5,0,-3,np.NaN,14])

In [39]:
s2

0     5.0
1     0.0
2    -3.0
3     NaN
4    14.0
dtype: float64

In [41]:
s2[s2.notnull()]

0     5.0
1     0.0
2    -3.0
4    14.0
dtype: float64

In [42]:
df1 = pd.DataFrame( np.arange(9).reshape(3,3) , columns = ['a','b','c'])

In [43]:
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [44]:
df1['c']

0    2
1    5
2    8
Name: c, dtype: int32

In [56]:
df1.loc[2]

a    6
b    7
c    8
Name: 2, dtype: int32

In [87]:
df1.loc[0:2]

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [90]:
df1['a'][0:3]

0    0
1    3
2    6
Name: a, dtype: int32

In [94]:
df1['d'] = [19,20,21]

In [95]:
df1

   a  b  c   d
0  0  1  2  19
1  3  4  5  20
2  6  7  8  21

In [97]:
np.sqrt(df1)

          a         b         c         d
0  0.000000  1.000000  1.414214  4.358899
1  1.732051  2.000000  2.236068  4.472136
2  2.449490  2.645751  2.828427  4.582576

In [98]:
def f(x):
    return x.max() - x.min()

In [99]:
f(df1)

a    6
b    6
c    6
d    2
dtype: int64

In [101]:
df1.apply( f , axis = 1)

0    19
1    17
2    15
dtype: int64

In [104]:
df1.mean( axis =1)

0     5.5
1     8.0
2    10.5
dtype: float64

In [106]:
df1.mean()

a     3.0
b     4.0
c     5.0
d    20.0
dtype: float64

In [105]:
df1.describe()

         a    b    c     d
count  3.0  3.0  3.0   3.0
mean   3.0  4.0  5.0  20.0
std    3.0  3.0  3.0   1.0
min    0.0  1.0  2.0  19.0
25%    1.5  2.5  3.5  19.5
50%    3.0  4.0  5.0  20.0
75%    4.5  5.5  6.5  20.5
max    6.0  7.0  8.0  21.0

In [107]:
seq2 = pd.Series([3,4,3,4,5,4,3,2],['2006','2007','2008','2009','2010','2011','2012','2013'])

In [108]:
seq2

2006    3
2007    4
2008    3
2009    4
2010    5
2011    4
2012    3
2013    2
dtype: int64

In [109]:
frame = pd.DataFrame(np.arange(16).reshape(4,4), index=['white','black','red','blue'],
... columns=['up','down','right','left'])

In [110]:
frame.to_json('frame.json')

In [111]:
ls

 Volume in drive C is SOE
 Volume Serial Number is 6827-826B

 Directory of C:\Users\rmusti

02/01/2019  12:00 PM    <DIR>          .
02/01/2019  12:00 PM    <DIR>          ..
01/30/2019  02:59 PM    <DIR>          .anaconda
01/30/2019  07:56 PM    <DIR>          .conda
01/30/2019  06:58 PM                43 .condarc
02/01/2019  10:35 AM    <DIR>          .ipynb_checkpoints
01/30/2019  03:06 PM    <DIR>          .ipython
01/30/2019  04:00 PM    <DIR>          .jupyter
01/30/2019  06:17 PM    <DIR>          .matplotlib
01/01/2019  07:58 PM    <DIR>          3D Objects
01/30/2019  06:01 PM    <DIR>          AnacondaProjects
01/01/2019  07:58 PM    <DIR>          Contacts
06/28/2017  06:13 PM             4,434 create_shortcut.vbs
02/01/2019  10:34 AM    <DIR>          Desktop
01/30/2019  02:41 PM    <DIR>          Documents
02/01/2019  08:43 AM    <DIR>          Downloads
01/01/2019  07:58 PM    <DIR>          Favorites
02/01/2019  12:00 PM               190 frame.json
01/30/2019  07:54 PM             6,917 Kaggle Airline Industry.ipynb
01/01/2019  07:58 PM    <DIR>          Links
12/18/2018  06:33 PM    <DIR>          logs
02/01/2019  10:32 AM            42,282 Merging 2 csv.ipynb
01/01/2019  07:58 PM    <DIR>          Music
08/27/2018  02:39 PM    <DIR>          OneDrive
08/27/2018  02:41 PM    <DIR>          OneDrive - Hewlett Packard Enterprise
01/01/2019  07:58 PM    <DIR>          Pictures
02/01/2019  11:48 AM            17,104 Practice.ipynb
12/07/2009  04:24 PM             1,657 reg_off2k7.vbs
01/01/2019  07:58 PM    <DIR>          Saved Games
01/01/2019  07:58 PM    <DIR>          Searches
08/12/2016  03:53 PM             2,980 Setup OneDrive.lnk
02/05/2016  02:22 AM           453,632 syspin.exe
01/01/2019  07:58 PM    <DIR>          Videos
               9 File(s)        529,239 bytes
              24 Dir(s)  350,411,943,936 bytes free

In [112]:
pd.read_json('frame.json')

       down  left  right  up
black     5     7      6   4
blue     13    15     14  12
red       9    11     10   8
white     1     3      2   0